  [
    {
      "name": "Cage Vol. I (Hardcover)",
      "title":"Investigating the murder of a teenage girl, Cage suddenly learns that a three-way gang war is under way for control of the turf"
    },
    {
      "name":"Call, the Vol. 1: The Brotherhood & the Wagon (Trade Paperback)",
      "title": "In the wake of September 11th, the world watched as firefighters, police officers and EMT workers selflessly risked their lives"
    },
    {
      "name": "Call, the Vol. 2: The Precinct (Trade Paperback)",
      "title": "Ordinary New York City cop Frankie Gunz Gunzer now has a new call to duty not just to uphold the law, but to save "
    },
    {
      "name": "Captain America: Red, White & Blue (Hardcover)",
      "title": "In this thought-provoking anthology, a world-class collection of top comic-book creators from around the globe presents a series"
    },
    {
      "name": "Captain Britain Vol. I (Trade Paperback)",
      "title":"Interior #11"
    },
    {
      "name": "SPIDER-MAN: THE COMPLETE FRANK MILLER HC (Hardcover)",
      "title": "Presenting visionary writer/artist Frank Miller's unique take on the world-famous wall-crawler including appearances by the Pu"
    },
    {
      "name": "Daredevil Legends Vol. II: Born Again (Trade Paperback)",
      "title":"Karen Page, Daredevil's former lover, trades away Daredevil's identity for a drug fix.  Matt Murdock must find strength as the K"
    },
    {
      "name": "Daredevil Legends Vol. III: Man Without Fear (Trade Paperback)",
      "title": "This classic tale explores Matt Murdock's formative years detailing the relationship between him and his father, and the event"
    },
    {
      "name": "Daredevil Visionaries: Frank Miller Vol. I (Trade Paperback)",
      "title": "Frank Miller's Daredevil submerged us in a world where heroes, pushed to the brink of madness, were allowed to mirror the human "
    },
    {
      "name": "DAREDEVIL VISIONARIES: FRANK MILLER VOL. 2 TPB (Trade Paperback)",
      "title": "This volume features the gritty, street-level action and moody atmosphere that made Miller's Daredevil classic including appea"
    },
    {
      "name": "DAREDEVIL VISIONARIES: FRANK MILLER VOL. 3 TPB (Trade Paperback)",
      "title": "Concluding Miller's complete run,  the Man Without Fear faces the Kingpin of Crime and the Hand and must come to grips with t"
    },
    {
      "name": "Daredevil Vol. II: Parts of a Hole (Trade Paperback)",
      "title": "Maya Lopez deaf, but capable of assimilating an individual's fighting style on sight has set her sights on Daredevil, who sh"
    },
    {
      "name": "Daredevil Vol. IV: Underboss (Trade Paperback)",
      "title": "A contract on Matt Murdock's life is somehow connected to the Kingpin's apparent murder at the hands of the mysterious Mr. Silke"
    },
    {
      "name": "DAREDEVIL VOL. 5: OUT TPB (Trade Paperback)",
      "title": "A down-on-his-luck FBI agent has sold the hero's most guarded secret to a tabloid newspaper, exposing Daredevil's identity to th"
    },
    {
      "name": "Daredevil/Elektra: Love & War (Hardcover)",
      "title": "Elektra: Assassin the story of how a tragic murder transformed an innocent, naive college student into a deadly assassin, and "
    },
    {
      "name": "Elektra & Wolverine: The Redeemer (Hardcover)",
      "title":"Haunted by her own father's death, Elektra finds that killing her latest target's daughter the only witness to the murder is"
    },
    {
      "name": "Elektra Lives Again (Hardcover)",
      "title": "Despite the fact that Elektra died in his arms, Daredevil is plagued by recurring nightmares and terrible premonitions that his "
    },
    {
      "name": "Elektra: The Scorpio Key (Trade Paperback)",
      "title": "S.H.I.E.L.D. offers Elektra a mission so dirty, so difficult, no one else could pull it off.  But if Elektra takes the job, she'"
    },
    {
      "name": "Essential Incredible Hulk Vol. I (Trade Paperback)",
      "title": "Caught in the heart of a nuclear explosion, mild-mannered scientist Bruce Banner finds himself during moments of extreme stres"
    },
    {
      "name" : "Essential Incredible Hulk Vol. II (Trade Paperback)",
      "title": "The second volume containing the Hulk's early adventures with appearances by the Sub-Mariner, the Mandarin, Ka-Zar and Nick Fury"
    }
  ]